docs: improve project README
